Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/3.0.2/samv71/atdf/ATSAMV71Q21.atdf
        <module name="TC" id="6082" version="ZI">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x4000C000"/>
            <signals>
              <signal pad="PA4" function="B" group="TCLK" index="0"/>
              <signal pad="PA28" function="B" group="TCLK" index="1"/>
              <signal pad="PA29" function="B" group="TCLK" index="2"/>
              <signal pad="PA0" function="B" group="TIOA" index="0"/>
              <signal pad="PA15" function="B" group="TIOA" index="1"/>
              <signal pad="PA26" function="B" group="TIOA" index="2"/>
              <signal pad="PA1" function="B" group="TIOB" index="0"/>
              <signal pad="PA16" function="B" group="TIOB" index="1"/>
              <signal pad="PA27" function="B" group="TIOB" index="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="40"/>
              <param name="INSTANCE_ID_CHANNEL0" value="23"/>
              <param name="INSTANCE_ID_CHANNEL1" value="24"/>
              <param name="INSTANCE_ID_CHANNEL2" value="25"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40010000"/>
            <signals>
              <signal pad="PC25" function="B" group="TCLK" index="3"/>
              <signal pad="PC28" function="B" group="TCLK" index="4"/>
              <signal pad="PC31" function="B" group="TCLK" index="5"/>
              <signal pad="PC23" function="B" group="TIOA" index="3"/>
              <signal pad="PC26" function="B" group="TIOA" index="4"/>
              <signal pad="PC29" function="B" group="TIOA" index="5"/>
              <signal pad="PC24" function="B" group="TIOB" index="3"/>
              <signal pad="PC27" function="B" group="TIOB" index="4"/>
              <signal pad="PC30" function="B" group="TIOB" index="5"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="41"/>
              <param name="INSTANCE_ID_CHANNEL0" value="26"/>
              <param name="INSTANCE_ID_CHANNEL1" value="27"/>
              <param name="INSTANCE_ID_CHANNEL2" value="28"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group address-space="base" name="TC2" name-in-module="TC" offset="0x40014000"/>
            <signals>
              <signal pad="PC7" function="B" group="TCLK" index="6"/>
              <signal pad="PC10" function="B" group="TCLK" index="7"/>
              <signal pad="PC14" function="B" group="TCLK" index="8"/>
              <signal pad="PC5" function="B" group="TIOA" index="6"/>
              <signal pad="PC8" function="B" group="TIOA" index="7"/>
              <signal pad="PC11" function="B" group="TIOA" index="8"/>
              <signal pad="PC6" function="B" group="TIOB" index="6"/>
              <signal pad="PC9" function="B" group="TIOB" index="7"/>
              <signal pad="PC12" function="B" group="TIOB" index="8"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="42"/>
              <param name="INSTANCE_ID_CHANNEL0" value="47"/>
              <param name="INSTANCE_ID_CHANNEL1" value="48"/>
              <param name="INSTANCE_ID_CHANNEL2" value="49"/>
            </parameters>
          </instance>
          <instance name="TC3">
            <register-group address-space="base" name="TC3" name-in-module="TC" offset="0x40054000"/>
            <signals>
              <signal pad="PE2" function="B" group="TCLK" index="9"/>
              <signal pad="PE5" function="B" group="TCLK" index="10"/>
              <signal pad="PD24" function="C" group="TCLK" index="11"/>
              <signal pad="PE0" function="B" group="TIOA" index="9"/>
              <signal pad="PE3" function="B" group="TIOA" index="10"/>
              <signal pad="PD21" function="C" group="TIOA" index="11"/>
              <signal pad="PE1" function="B" group="TIOB" index="9"/>
              <signal pad="PE4" function="B" group="TIOB" index="10"/>
              <signal pad="PD22" function="C" group="TIOB" index="11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="43"/>
              <param name="INSTANCE_ID_CHANNEL0" value="50"/>
              <param name="INSTANCE_ID_CHANNEL1" value="51"/>
              <param name="INSTANCE_ID_CHANNEL2" value="52"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="6334" version="G">
          <instance name="TRNG">
            <register-group address-space="base" name="TRNG" name-in-module="TRNG" offset="0x40070000"/>
            <parameters>
              <param name="INSTANCE_ID" value="57"/>
            </parameters>
          </instance>
        </module>
        <module name="TWIHS" id="11210" version="X">
          <instance name="TWIHS0">
            <register-group address-space="base" name="TWIHS0" name-in-module="TWIHS" offset="0x40018000"/>
            <signals>
              <signal pad="PA4" function="A" group="TWCK" index="0"/>
              <signal pad="PA3" function="A" group="TWD" index="0"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="15"/>
              <param name="DMAC_ID_TX" value="14"/>
              <param name="INSTANCE_ID" value="19"/>
            </parameters>
          </instance>
          <instance name="TWIHS1">
            <register-group address-space="base" name="TWIHS1" name-in-module="TWIHS" offset="0x4001C000"/>
            <signals>
              <signal pad="PB5" function="A" group="TWCK" index="1"/>
              <signal pad="PB4" function="A" group="TWD" index="1"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="17"/>
              <param name="DMAC_ID_TX" value="16"/>
              <param name="INSTANCE_ID" value="20"/>
            </parameters>
          </instance>
