Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/3.0.2/samv71/atdf/ATSAMV71Q21.atdf
      <value-group caption="" name="AFEC_EMR__SIGNMODE">
        <value caption="Single-Ended channels: Unsigned conversions.Differential channels: Signed conversions." name="SE_UNSG_DF_SIGN" value="0x0"/>
        <value caption="Single-Ended channels: Signed conversions.Differential channels: Unsigned conversions." name="SE_SIGN_DF_UNSG" value="0x1"/>
        <value caption="All channels: Unsigned conversions." name="ALL_UNSIGNED" value="0x2"/>
        <value caption="All channels: Signed conversions." name="ALL_SIGNED" value="0x3"/>
      </value-group>
      <value-group caption="" name="AFEC_TEMPMR__TEMPCMPMOD">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="AFEC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
    <module name="CHIPID" caption="Chip Identifier" id="6417" version="ZC">
      <register-group name="CHIPID">
        <register caption="Chip ID Register" name="CHIPID_CIDR" offset="0x0" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="CHIPID_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="CHIPID_CIDR__NVPSIZ"/>
          <bitfield caption="Second Nonvolatile Program Memory Size" mask="0x0000F000" name="NVPSIZ2" values="CHIPID_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="CHIPID_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="CHIPID_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="CHIPID_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="CHIPID_EXID" offset="0x4" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID"/>
        </register>
      </register-group>
      <value-group caption="" name="CHIPID_CIDR__EPROC">
        <value caption="Cortex-M7" name="SAMx7" value="0x0"/>
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
        <value caption="Cortex-M4" name="CM4" value="0x7"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="160 Kbytes" name="_160K" value="0x8"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__SRAMSIZ">
        <value caption="48 Kbytes" name="_48K" value="0x0"/>
        <value caption="192 Kbytes" name="_192K" value="0x1"/>
        <value caption="384 Kbytes" name="_384K" value="0x2"/>
        <value caption="6 Kbytes" name="_6K" value="0x3"/>
        <value caption="24 Kbytes" name="_24K" value="0x4"/>
        <value caption="4 Kbytes" name="_4K" value="0x5"/>
        <value caption="80 Kbytes" name="_80K" value="0x6"/>
        <value caption="160 Kbytes" name="_160K" value="0x7"/>
        <value caption="8 Kbytes" name="_8K" value="0x8"/>
        <value caption="16 Kbytes" name="_16K" value="0x9"/>
        <value caption="32 Kbytes" name="_32K" value="0xA"/>
        <value caption="64 Kbytes" name="_64K" value="0xB"/>
        <value caption="128 Kbytes" name="_128K" value="0xC"/>
        <value caption="256 Kbytes" name="_256K" value="0xD"/>
        <value caption="96 Kbytes" name="_96K" value="0xE"/>
        <value caption="512 Kbytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__ARCH">
        <value caption="SAM V71" name="SAMV71" value="0x12"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash Memory- NVPSIZ is ROM size- NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
    </module>
    <module name="DACC" caption="Digital-to-Analog Converter Controller" id="11246" version="E">
      <register-group name="DACC">
        <register caption="Control Register" name="DACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="DACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Max Speed Mode for Channel 0" mask="0x00000001" name="MAXS0" values="DACC_MR__MAXS0"/>
          <bitfield caption="Max Speed Mode for Channel 1" mask="0x00000002" name="MAXS1" values="DACC_MR__MAXS1"/>
          <bitfield caption="Word Transfer Mode" mask="0x00000010" name="WORD" values="DACC_MR__WORD"/>
          <bitfield caption="Must always be written to 0." mask="0x00000020" name="ZERO"/>
          <bitfield caption="Differential Mode" mask="0x00800000" name="DIFF" values="DACC_MR__DIFF"/>
          <bitfield caption="Peripheral Clock to DAC Clock Ratio" mask="0x0F000000" name="PRESCALER"/>
        </register>
        <register caption="Trigger Register" name="DACC_TRIGR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Trigger Enable of Channel 0" mask="0x00000001" name="TRGEN0" values="DACC_TRIGR__TRGEN0"/>
          <bitfield caption="Trigger Enable of Channel 1" mask="0x00000002" name="TRGEN1" values="DACC_TRIGR__TRGEN1"/>
          <bitfield caption="Trigger Selection of Channel 0" mask="0x00000070" name="TRGSEL0" values="DACC_TRIGR__TRGSEL0"/>
          <bitfield caption="Trigger Selection of Channel 1" mask="0x00000700" name="TRGSEL1" values="DACC_TRIGR__TRGSEL1"/>
          <bitfield caption="Over Sampling Ratio of Channel 0" mask="0x00070000" name="OSR0" values="DACC_TRIGR__OSR0"/>
          <bitfield caption="Over Sampling Ratio of Channel 1" mask="0x00700000" name="OSR1" values="DACC_TRIGR__OSR1"/>
        </register>
        <register caption="Channel Enable Register" name="DACC_CHER" offset="0x10" rw="W" size="4" atomic-op="set:DACC_CHSR">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
        </register>
        <register caption="Channel Disable Register" name="DACC_CHDR" offset="0x14" rw="W" size="4" atomic-op="clear:DACC_CHSR">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
        </register>
        <register caption="Channel Status Register" name="DACC_CHSR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="DAC Ready Flag" mask="0x00000100" name="DACRDY0"/>
          <bitfield caption="DAC Ready Flag" mask="0x00000200" name="DACRDY1"/>
        </register>
        <register caption="Conversion Data Register 0" name="DACC_CDR" offset="0x1C" rw="W" size="4" count="2">
          <bitfield caption="Data to Convert for channel 0" mask="0x0000FFFF" name="DATA0"/>
          <bitfield caption="Data to Convert for channel 1" mask="0xFFFF0000" name="DATA1"/>
        </register>
        <register caption="Interrupt Enable Register" name="DACC_IER" offset="0x24" rw="W" size="4" atomic-op="set:DACC_IMR">
          <bitfield caption="Transmit Ready Interrupt Enable of channel 0" mask="0x00000001" name="TXRDY0"/>
          <bitfield caption="Transmit Ready Interrupt Enable of channel 1" mask="0x00000002" name="TXRDY1"/>
          <bitfield caption="End of Conversion Interrupt Enable of channel 0" mask="0x00000010" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable of channel 1" mask="0x00000020" name="EOC1"/>
        </register>
        <register caption="Interrupt Disable Register" name="DACC_IDR" offset="0x28" rw="W" size="4" atomic-op="clear:DACC_IMR">
          <bitfield caption="Transmit Ready Interrupt Disable of channel 0" mask="0x00000001" name="TXRDY0"/>
          <bitfield caption="Transmit Ready Interrupt Disable of channel 1" mask="0x00000002" name="TXRDY1"/>
          <bitfield caption="End of Conversion Interrupt Disable of channel 0" mask="0x00000010" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable of channel 1" mask="0x00000020" name="EOC1"/>
        </register>
