Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/3.0.2/samv71/atdf/ATSAMV71Q21.atdf
        <register caption="Screening Type 2 Compare Word 1 Register (index = 9)" name="GMAC_ST2CW19" offset="0x74C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW19__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 10)" name="GMAC_ST2CW010" offset="0x750" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 10)" name="GMAC_ST2CW110" offset="0x754" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW110__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 11)" name="GMAC_ST2CW011" offset="0x758" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 11)" name="GMAC_ST2CW111" offset="0x75C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW111__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 12)" name="GMAC_ST2CW012" offset="0x760" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 12)" name="GMAC_ST2CW112" offset="0x764" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW112__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 13)" name="GMAC_ST2CW013" offset="0x768" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 13)" name="GMAC_ST2CW113" offset="0x76C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW113__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 14)" name="GMAC_ST2CW014" offset="0x770" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 14)" name="GMAC_ST2CW114" offset="0x774" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW114__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 15)" name="GMAC_ST2CW015" offset="0x778" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 15)" name="GMAC_ST2CW115" offset="0x77C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW115__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 16)" name="GMAC_ST2CW016" offset="0x780" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 16)" name="GMAC_ST2CW116" offset="0x784" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW116__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 17)" name="GMAC_ST2CW017" offset="0x788" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 17)" name="GMAC_ST2CW117" offset="0x78C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW117__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 18)" name="GMAC_ST2CW018" offset="0x790" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
