Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/3.0.2/samv71/atdf/ATSAMV71Q21.atdf
        <register caption="Interrupt Mask Register" name="PMC_IMR" offset="0x006C" rw="R" size="4" atomic-op="read:PMC_IMR">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Mask" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Mask" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Mask" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="UTMI PLL Lock Interrupt Mask" mask="0x00000040" name="LOCKU"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Mask" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Mask" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Mask" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Programmable Clock Ready 3 Interrupt Mask" mask="0x00000800" name="PCKRDY3"/>
          <bitfield caption="Programmable Clock Ready 4 Interrupt Mask" mask="0x00001000" name="PCKRDY4"/>
          <bitfield caption="Programmable Clock Ready 5 Interrupt Mask" mask="0x00002000" name="PCKRDY5"/>
          <bitfield caption="Programmable Clock Ready 6 Interrupt Mask" mask="0x00004000" name="PCKRDY6"/>
          <bitfield caption="Main Clock Source Oscillator Selection Status Interrupt Mask" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main RC Status Interrupt Mask" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Mask" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="32.768 kHz Crystal Oscillator Error Interrupt Mask" mask="0x00200000" name="XT32KERR"/>
        </register>
        <register caption="Fast Startup Mode Register" name="PMC_FSMR" offset="0x0070" rw="RW" size="4">
          <bitfield caption="Fast Startup Input Enable 0" mask="0x00000001" name="FSTT0"/>
          <bitfield caption="Fast Startup Input Enable 1" mask="0x00000002" name="FSTT1"/>
          <bitfield caption="Fast Startup Input Enable 2" mask="0x00000004" name="FSTT2"/>
          <bitfield caption="Fast Startup Input Enable 3" mask="0x00000008" name="FSTT3"/>
          <bitfield caption="Fast Startup Input Enable 4" mask="0x00000010" name="FSTT4"/>
          <bitfield caption="Fast Startup Input Enable 5" mask="0x00000020" name="FSTT5"/>
          <bitfield caption="Fast Startup Input Enable 6" mask="0x00000040" name="FSTT6"/>
          <bitfield caption="Fast Startup Input Enable 7" mask="0x00000080" name="FSTT7"/>
          <bitfield caption="Fast Startup Input Enable 8" mask="0x00000100" name="FSTT8"/>
          <bitfield caption="Fast Startup Input Enable 9" mask="0x00000200" name="FSTT9"/>
          <bitfield caption="Fast Startup Input Enable 10" mask="0x00000400" name="FSTT10"/>
          <bitfield caption="Fast Startup Input Enable 11" mask="0x00000800" name="FSTT11"/>
          <bitfield caption="Fast Startup Input Enable 12" mask="0x00001000" name="FSTT12"/>
          <bitfield caption="Fast Startup Input Enable 13" mask="0x00002000" name="FSTT13"/>
          <bitfield caption="Fast Startup Input Enable 14" mask="0x00004000" name="FSTT14"/>
          <bitfield caption="Fast Startup Input Enable 15" mask="0x00008000" name="FSTT15"/>
          <bitfield caption="RTT Alarm Enable" mask="0x00010000" name="RTTAL"/>
          <bitfield caption="RTC Alarm Enable" mask="0x00020000" name="RTCAL"/>
          <bitfield caption="USB Alarm Enable" mask="0x00040000" name="USBAL"/>
          <bitfield caption="Low-power Mode" mask="0x00100000" name="LPM"/>
          <bitfield caption="Flash Low-power Mode" mask="0x00600000" name="FLPM" values="PMC_FSMR__FLPM"/>
          <bitfield caption="Force Flash Low-power Mode" mask="0x00800000" name="FFLPM"/>
        </register>
        <register caption="Fast Startup Polarity Register" name="PMC_FSPR" offset="0x0074" rw="RW" size="4">
          <bitfield caption="Fast Startup Input Polarity 0" mask="0x00000001" name="FSTP0"/>
          <bitfield caption="Fast Startup Input Polarity 1" mask="0x00000002" name="FSTP1"/>
          <bitfield caption="Fast Startup Input Polarity 2" mask="0x00000004" name="FSTP2"/>
          <bitfield caption="Fast Startup Input Polarity 3" mask="0x00000008" name="FSTP3"/>
          <bitfield caption="Fast Startup Input Polarity 4" mask="0x00000010" name="FSTP4"/>
          <bitfield caption="Fast Startup Input Polarity 5" mask="0x00000020" name="FSTP5"/>
          <bitfield caption="Fast Startup Input Polarity 6" mask="0x00000040" name="FSTP6"/>
          <bitfield caption="Fast Startup Input Polarity 7" mask="0x00000080" name="FSTP7"/>
          <bitfield caption="Fast Startup Input Polarity 8" mask="0x00000100" name="FSTP8"/>
          <bitfield caption="Fast Startup Input Polarity 9" mask="0x00000200" name="FSTP9"/>
          <bitfield caption="Fast Startup Input Polarity 10" mask="0x00000400" name="FSTP10"/>
          <bitfield caption="Fast Startup Input Polarity 11" mask="0x00000800" name="FSTP11"/>
          <bitfield caption="Fast Startup Input Polarity 12" mask="0x00001000" name="FSTP12"/>
          <bitfield caption="Fast Startup Input Polarity 13" mask="0x00002000" name="FSTP13"/>
          <bitfield caption="Fast Startup Input Polarity 14" mask="0x00004000" name="FSTP14"/>
          <bitfield caption="Fast Startup Input Polarity 15" mask="0x00008000" name="FSTP15"/>
        </register>
        <register caption="Fault Output Clear Register" name="PMC_FOCR" offset="0x0078" rw="W" size="4">
          <bitfield caption="Fault Output Clear" mask="0x00000001" name="FOCLR"/>
        </register>
        <register caption="Write Protection Mode Register" name="PMC_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PMC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="PMC_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
