Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/3.0.2/samv71/atdf/ATSAMV71Q21.atdf
      <value-group caption="" name="RTC_SR__SEC">
        <value caption="No second event has occurred since the last clear." name="NO_SECEVENT" value="0"/>
        <value caption="At least one second event has occurred since the last clear." name="SECEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__TIMEV">
        <value caption="No time event has occurred since the last clear." name="NO_TIMEVENT" value="0"/>
        <value caption="At least one time event has occurred since the last clear." name="TIMEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__CALEV">
        <value caption="No calendar event has occurred since the last clear." name="NO_CALEVENT" value="0"/>
        <value caption="At least one calendar event has occurred since the last clear." name="CALEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__TDERR">
        <value caption="The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR)." name="CORRECT" value="0"/>
        <value caption="The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid." name="ERR_TIMEDATE" value="1"/>
      </value-group>
    </module>
    <module name="RTT" caption="Real-time Timer" id="6081" version="M">
      <register-group name="RTT">
        <register caption="Mode Register" name="RTT_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Real-time Timer Prescaler Value" mask="0x0000FFFF" name="RTPRES"/>
          <bitfield caption="Alarm Interrupt Enable" mask="0x00010000" name="ALMIEN"/>
          <bitfield caption="Real-time Timer Increment Interrupt Enable" mask="0x00020000" name="RTTINCIEN"/>
          <bitfield caption="Real-time Timer Restart" mask="0x00040000" name="RTTRST"/>
          <bitfield caption="Real-time Timer Disable" mask="0x00100000" name="RTTDIS"/>
          <bitfield caption="Real-Time Clock 1Hz Clock Selection" mask="0x01000000" name="RTC1HZ"/>
        </register>
        <register caption="Alarm Register" name="RTT_AR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Alarm Value" mask="0xFFFFFFFF" name="ALMV"/>
        </register>
        <register caption="Value Register" name="RTT_VR" offset="0x08" rw="R" size="4">
          <bitfield caption="Current Real-time Value" mask="0xFFFFFFFF" name="CRTV"/>
        </register>
        <register caption="Status Register" name="RTT_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Real-time Alarm Status (cleared on read)" mask="0x00000001" name="ALMS"/>
          <bitfield caption="Prescaler Roll-over Status (cleared on read)" mask="0x00000002" name="RTTINC"/>
        </register>
      </register-group>
    </module>
    <module name="SDRAMC" caption="SDRAM Controller" id="6100" version="S">
      <register-group name="SDRAMC">
        <register caption="SDRAMC Mode Register" name="SDRAMC_MR" offset="0x00" rw="RW" size="4">
          <bitfield caption="SDRAMC Command Mode" mask="0x00000007" name="MODE" values="SDRAMC_MR__MODE"/>
        </register>
        <register caption="SDRAMC Refresh Timer Register" name="SDRAMC_TR" offset="0x04" rw="RW" size="4">
          <bitfield caption="SDRAMC Refresh Timer Count" mask="0x00000FFF" name="COUNT"/>
        </register>
        <register caption="SDRAMC Configuration Register" name="SDRAMC_CR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Number of Column Bits" mask="0x00000003" name="NC" values="SDRAMC_CR__NC"/>
          <bitfield caption="Number of Row Bits" mask="0x0000000C" name="NR" values="SDRAMC_CR__NR"/>
          <bitfield caption="Number of Banks" mask="0x00000010" name="NB" values="SDRAMC_CR__NB"/>
          <bitfield caption="CAS Latency" mask="0x00000060" name="CAS" values="SDRAMC_CR__CAS"/>
          <bitfield caption="Data Bus Width" mask="0x00000080" name="DBW"/>
          <bitfield caption="Write Recovery Delay" mask="0x00000F00" name="TWR"/>
          <bitfield caption="Row Cycle Delay and Row Refresh Cycle" mask="0x0000F000" name="TRC_TRFC"/>
          <bitfield caption="Row Precharge Delay" mask="0x000F0000" name="TRP"/>
          <bitfield caption="Row to Column Delay" mask="0x00F00000" name="TRCD"/>
          <bitfield caption="Active to Precharge Delay" mask="0x0F000000" name="TRAS"/>
          <bitfield caption="Exit Self-Refresh to Active Delay" mask="0xF0000000" name="TXSR"/>
        </register>
        <register caption="SDRAMC Low Power Register" name="SDRAMC_LPR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Low-power Configuration Bits" mask="0x00000003" name="LPCB" values="SDRAMC_LPR__LPCB"/>
          <bitfield caption="Partial Array Self-refresh (only for low-power SDRAM)" mask="0x00000070" name="PASR"/>
          <bitfield caption="Temperature Compensated Self-Refresh (only for low-power SDRAM)" mask="0x00000300" name="TCSR"/>
          <bitfield caption="Drive Strength (only for low-power SDRAM)" mask="0x00000C00" name="DS"/>
          <bitfield caption="Time to Define When Low-power Mode Is Enabled" mask="0x00003000" name="TIMEOUT" values="SDRAMC_LPR__TIMEOUT"/>
        </register>
        <register caption="SDRAMC Interrupt Enable Register" name="SDRAMC_IER" offset="0x14" rw="W" size="4" atomic-op="set:SDRAMC_IMR">
          <bitfield caption="Refresh Error Interrupt Enable" mask="0x00000001" name="RES"/>
        </register>
        <register caption="SDRAMC Interrupt Disable Register" name="SDRAMC_IDR" offset="0x18" rw="W" size="4" atomic-op="clear:SDRAMC_IMR">
          <bitfield caption="Refresh Error Interrupt Disable" mask="0x00000001" name="RES"/>
        </register>
        <register caption="SDRAMC Interrupt Mask Register" name="SDRAMC_IMR" offset="0x1C" rw="R" size="4" atomic-op="read:SDRAMC_IMR">
          <bitfield caption="Refresh Error Interrupt Mask" mask="0x00000001" name="RES"/>
        </register>
